{"config": [{"config": {"activity_regularizer": null, "name": "conv2d_2", "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "batch_input_shape": [null, 48, 48, 3], "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_constraint": null, "trainable": true, "name": "dense_3", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "units": 128}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "softmax", "bias_constraint": null, "trainable": true, "name": "dense_4", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "units": 6}, "class_name": "Dense"}], "keras_version": "2.0.5", "class_name": "Sequential", "backend": "theano"}